CSI API ETABS v1

# eDeckType Enumeration

---

The possible deck types.

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    public enum eDeckType

    Public Enumeration eDeckType

    Dim instance As eDeckType

    public enum class eDeckType

    type eDeckType

Members

| Member name| Value| Description
---|---|---|---
| Filled| 1|
| Unfilled| 2|
| SolidSlab| 3|

Remarks

See Also

#### Reference

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com